const users = [{
    name : 'Temo',
    age: 25
}, {
    name: 'Lasha',
    age: 21
}, {
    name: 'Ana',
    age: 28
}
]

let minAge = 9999; //ამით აკონტროლებ ყველაზე პატარა ასაკს
let name; //ამით სახელს შეინახავ ყველაზე უმცროსისას

users.forEach((user) => {  //user არის თითო user ჯერ თემო მერე ლაშა მერე ანა და ა.შ
                          //minAge თი აკონტროლებ უბრალოდ ყველაზე პატარა ასაკი როიყო აქამდე რაც შეგხვდა
    if (user.age < minAge){    //თუ ეხლანდელი user ეხლა რომელზეც ვართ მაგის ასაკი minAge ზე ნაკლებია  nameს და minAgeს ეხლანდელი
        name = user.name;      //user ისას გახდი, ისე გამოდის რომ აქამდე რომელი იუზერებიც  გავიარეთ ყველაზე უმცროსი ეს ტიპია
        minAge = user.age;
    }
});

console.log(name); //ლუპის გარეთ უკვე გავიარეთ ყველა user და გამოდის რო ყველაზე უმცროსის ასაკი და სახელია დარჩენილი  გარეთ იმ 2 ცვლადში